Revit 2025 API
gbXMLSpaceType Enumeration
 This enumeration corresponds to the spaceType attribute in gbXML. The enumerated attribute identifies the type of space defined and allows to better approximate the actual internal loads and schedules associated with the defined space type.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum gbXMLSpaceType
Public Enumeration gbXMLSpaceType
public enum class gbXMLSpaceType
type gbXMLSpaceType
Members
Member name | Value | Description
ActiveStorage | 0
ActiveStorageHospitalOrHealthcare | 1
AirOrTrainOrBusBaggageArea | 2
AirportConcourse | 3
AtriumEachAdditionalFloor | 4
AtriumFirstThreeFloors | 5
AudienceOrSeatingAreaPenitentiary | 6
AudienceOrSeatingAreaExerciseCenter | 7
AudienceOrSeatingAreaGymnasium | 8
AudienceOrSeatingAreaSportsArena | 9
NoSpaceType | -1
AudienceOrSeatingAreaConventionCenter | 10
AudienceOrSeatingAreaMotionPictureTheatre | 11
AudienceOrSeatingAreaPerformingArtsTheatre | 12
AudienceOrSeatingAreaReligious | 13
AudienceOrSeatingAreaPoliceOrFireStations | 14
AudienceOrSeatingAreaCourtHouse | 15
AudienceOrSeatingAreaAuditorium | 16
BankCustomerArea | 17
BankingActivityAreaOffice | 18
BarberAndBeautyParlor | 19
CustomizeSpaceType | -2
CardFileAndCataloguingLibrary | 20
ClassroomOrLectureOrTrainingPenitentiary | 21
ClassroomOrLectureOrTraining | 22
ConfinementCellsPenitentiary | 23
ConfinementCellsCourtHouse | 24
ConferenceMeetingOrMultipurpose | 25
CorridorOrTransition | 26
CorridorOrTransitionManufacturingFacility | 27
CorridorsWithPatientWaitingExamHospitalOrHealthcare | 28
CourtSportsAreaSportsArena | 29
CourtroomCourtHouse | 30
DepartmentStoreSalesAreaRetail | 31
DetailedManufacturingFacility | 32
DiningArea | 33
DiningAreaHotel | 34
DiningAreaFamilyDining | 35
DiningAreaLoungeOrLeisureDining | 36
DiningAreaMotel | 37
DiningAreaTransportation | 38
DiningAreaPenitentiary | 39
DiningAreaCivilServices | 40
DormitoryBedroom | 41
DormitoryStudyHall | 42
DressingOrLockerOrFittingRoomGymnasium | 43
DressingOrLockerOrFittingRoomCourtHouse | 44
DressingOrLockerOrFittingRoomPerformingArtsTheatre | 45
DressingOrLockerOrFittingRoomAuditorium | 46
DressingOrLockerOrFittingRoomExerciseCenter | 47
ElectricalOrMechanical | 48
ElevatorLobbies | 49
EmergencyHospitalOrHealthcare | 50
EquipmentRoomManufacturingFacility | 51
ExamOrTreatmentHospitalOrHealthcare | 52
ExerciseAreaExerciseCenter | 53
ExerciseAreaGymnasium | 54
ExhibitSpaceConventionCenter | 55
FellowshipHallReligiousBuildings | 56
FineMaterialWarehouse | 57
FineMerchandiseSalesAreaRetail | 58
FireStationEngineRoomPoliceOrFireStation | 59
FoodPreparation | 60
GarageServiceOrRepairAutomotiveFacility | 61
GeneralHighBayManufacturingFacility | 62
GeneralLowBayManufacturingFacility | 63
GeneralExhibitionMuseum | 64
HospitalNurseryHospitalOrHealthcare | 65
HospitalOrMedicalSuppliesHospitalOrHealthcare | 66
HospitalOrRadiologyHospitalOrHealthcare | 67
HotelOrConferenceCenterConferenceOrMeeting | 68
InactiveStorage | 69
JudgesChambersCourtHouse | 70
LaboratoryOffice | 71
LaundryIroningAndSorting | 72
LaundryWashingHospitalOrHealthcare | 73
LibraryAudioVisualLibraryAudioVisual | 74
LivingQuartersDormitory | 75
LivingQuartersMotel | 76
LivingQuartersHotel | 77
Lobby | 78
LobbyReligiousBuildings | 79
LobbyMotionPictureTheatre | 80
LobbyAuditorium | 81
LobbyPerformingArtsTheatre | 82
LobbyPostOffice | 83
LobbyHotel | 84
LoungeOrRecreation | 85
MallConcourseSalesAreaRetail | 86
MassMerchandisingSalesAreaRetail | 87
MediumOrBulkyMaterialWarehouse | 88
MerchandisingSalesAreaRetail | 89
MuseumAndGalleryStorage | 90
NurseStationHospitalOrHealthcare | 91
OfficeEnclosed | 92
OfficeOpenPlan | 93
OfficeCommonActivityAreasInactiveStorage | 94
OperatingRoomHospitalOrHealthcare | 95
OtherTelevisedPlayingAreaSportsArena | 96
ParkingAreaAttendantOnlyParkingGarage | 97
ParkingAreaPedestrianParkingGarage | 98
PatientRoomHospitalOrHealthcare | 99
PersonalServicesSalesAreaRetail | 100
PharmacyHospitalOrHealthcare | 101
PhysicalTherapyHospitalOrHealthcare | 102
PlayingAreaGymnasium | 103
Plenum | 104
PoliceStationLaboratoryPoliceOrFireStations | 105
PublicAndStaffLoungeHospitalOrHealthcare | 106
ReadingAreaLibrary | 107
ReceptionOrWaitingTransportation | 108
ReceptionOrWaitingMotel | 109
ReceptionOrWaitingHotel | 110
RecoveryHospitalOrHealthcare | 111
RestorationMuseum | 112
Restrooms | 113
RingSportsAreaSportsArena | 114
SleepingQuartersPoliceOrFireStation | 115
SortingAreaPostOffice | 116
SpecialtyStoreSalesAreaRetail | 117
StacksLibrary | 118
StairsInactive | 119
Stairway | 120
SupermarketSalesAreaRetail | 121
TerminalTicketCounterTransportation | 122
WorkshopWorkshop | 123
WorshipPulpitChoirReligious | 124
NoOfSpaceTypes | 125
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace